app/Controllers/Admin/PagesController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    private function checkAdminAccess()
    {
        if (!session()->get('user_id')) {
            // Store the intended URL for redirect after login
            session()->set('redirect_to', current_url());
            session()->setFlashdata('error', 'Please login to access the admin panel.');
            return redirect()->to('/login');
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find(session()->get('user_id'));

SELECT *
FROM `pages`
WHERE `pages`.`id` = '1'
---
    public function edit($id)
    {
        $accessCheck = $this->checkAdminAccess();
        if ($accessCheck !== true) {
            return $accessCheck;
        }

        $page = $this->pageModel->find($id);

SELECT *
FROM `pages`
WHERE `pages`.`id` = '1'
---
    public function update($id)
    {
        log_message('info', '=== UPDATE METHOD CALLED ===');
        log_message('info', 'Request method: ' . $this->request->getMethod());
        log_message('info', 'Request URI: ' . $this->request->getUri());

        $accessCheck = $this->checkAdminAccess();
        if ($accessCheck !== true) {
            return $accessCheck;
        }

        $page = $this->pageModel->find($id);

UPDATE `pages` SET `title` = 'About Us', `slug` = 'about-us', `content` = '<h2>About Microdose Mushroom</h2>\r\n<p>Welcome to Microdose Mushroom, your trusted microdose destination. We are committed to providing you with the best microdose products and exceptional customer service.</p>\r\n<p>Our mission is to make microdosing convenient, reliable, and accessible for everyone.</p>', `meta_title` = 'About Us - Microdose Mushroom', `meta_description` = 'Learn more about Microdose Mushroom, your trusted online microdose destination.', `meta_keywords` = '', `is_active` = 1, `show_in_header` = 1, `show_in_footer` = 1, `header_order` = 2, `footer_order` = 2, `template` = 'default', `updated_at` = '2025-08-15 07:44:50'
WHERE `pages`.`id` IN ('1')
SELECT *
FROM `pages`
WHERE `pages`.`id` = '1'
---
            $testResult = $testQuery->getRow();
            log_message('info', 'Database test - page exists: ' . json_encode($testResult));

            $updateResult = $this->pageModel->update($id, $data);
            log_message('info', 'Update result: ' . ($updateResult ? 'success' : 'failed'));

            // Check if update actually worked by fetching the record
            $updatedPage = $this->pageModel->find($id);

SELECT *
FROM `pages`
WHERE `pages`.`id` = '6'
DELETE FROM `pages`
WHERE `id` IN ('6')
---
    public function delete($id)
    {
        $accessCheck = $this->checkAdminAccess();
        if ($accessCheck !== true) {
            return $accessCheck;
        }

        $page = $this->pageModel->find($id);
        if (!$page) {
            return $this->response->setJSON(['success' => false, 'message' => 'Page not found']);
        }

        if ($this->pageModel->delete($id)) {