app/Controllers/AdminController.php

    private function checkAdminAccess()
    {
        // Check if user is logged in
        if (!session()->get('user_id')) {
            // Store the intended URL for redirect after login
            session()->set('redirect_to', current_url());
            session()->setFlashdata('error', 'Please login to access the admin panel.');
            return redirect()->to('/login');
        }

        // Verify user exists and has admin role
        $user = $this->userModel->find(session()->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '13'

    private function getAdminData($activeSection = 'dashboard')
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '13'