app/Controllers/OrderController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    public function checkout()
    {
        if (!session()->get('user_id')) {
            session()->set('redirect_to', '/checkout');
            return redirect()->to('/login');
        }

        $userId = session()->get('user_id');
        $sessionId = session()->session_id;
        $cartItems = $this->cartModel->getCartItemsWithDetails($userId, $sessionId);

        if (empty($cartItems)) {
            session()->setFlashdata('error', 'Your cart is empty');
            return redirect()->to('/cart');
        }

        $cartTotal = $this->cartModel->getCartTotal($userId, $sessionId);
        $user = $this->userModel->find($userId);