app/Models/BannerModel.php

SELECT *
FROM `banners`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC, `created_at` DESC
 LIMIT 5
---
    public function getSliderBanners($limit = 5)
    {
        return $this->where('is_active', 1)
                   ->orderBy('sort_order', 'ASC')
                   ->orderBy('created_at', 'DESC')
                   ->limit($limit)
                   ->findAll();