app/Models/CartModel.php

    public function getCartItems($userId = null, $sessionId = null)
    {
        $builder = $this->select('cart.*, products.name, products.slug, products.image, products.stock_quantity, products.sale_price,
                                 product_variants.sku as variant_sku, product_variants.price as variant_price,
                                 product_variants.sale_price as variant_sale_price, product_variants.stock_quantity as variant_stock,
                                 product_variants.image as variant_image')
            ->join('products', 'products.id = cart.product_id')
            ->join('product_variants', 'product_variants.id = cart.variant_id', 'left')
            ->where('products.is_active', 1);

        if ($userId) {
            $builder->where('cart.user_id', $userId);
        } else {
            $builder->where('cart.session_id', $sessionId);
        }

        $items = $builder->orderBy('cart.created_at', 'DESC')->findAll();
---
SELECT `cart`.*, `products`.`name`, `products`.`slug`, `products`.`image`, `products`.`stock_quantity`, `products`.`sale_price`, `product_variants`.`sku` as `variant_sku`, `product_variants`.`price` as `variant_price`, `product_variants`.`sale_price` as `variant_sale_price`, `product_variants`.`stock_quantity` as `variant_stock`, `product_variants`.`image` as `variant_image`
FROM `cart`
JOIN `products` ON `products`.`id` = `cart`.`product_id`
LEFT JOIN `product_variants` ON `product_variants`.`id` = `cart`.`variant_id`
WHERE `products`.`is_active` = 1
AND `cart`.`user_id` = '13'
ORDER BY `cart`.`created_at` DESC

    public function getCartCount($userId = null, $sessionId = null)
    {
        $builder = $this->selectSum('quantity');

        if ($userId) {
            $builder->where('user_id', $userId);
        } else {
            $builder->where('session_id', $sessionId);
        }

        $result = $builder->first();
---
SELECT SUM(`quantity`) AS `quantity`
FROM `cart`
WHERE `session_id` = '7461c6cfe44e621e5ad40355140f07eb'
 LIMIT 1