app/Models/CategoryModel.php

    public function getActiveCategories()
    {
        return $this->where('is_active', 1)
                   ->orderBy('sort_order', 'ASC')
                   ->orderBy('name', 'ASC')
                   ->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC, `name` ASC

    public function getCategoryBySlug($slug)
    {
        return $this->where('slug', $slug)
                   ->where('is_active', 1)
                   ->first();
---
SELECT *
FROM `categories`
WHERE `slug` = 'microdose-mushrooms'
AND `is_active` = 1
 LIMIT 1

    public function getCategoriesWithProductCount()
    {
        return $this->select('categories.*, COUNT(products.id) as product_count')
                   ->join('products', 'products.category_id = categories.id', 'left')
                   ->where('categories.is_active', 1)
                   ->where('products.is_active', 1)
                   ->groupBy('categories.id')
                   ->orderBy('categories.sort_order', 'ASC')
                   ->findAll();
---
SELECT `categories`.*, COUNT(products.id) as product_count
FROM `categories`
LEFT JOIN `products` ON `products`.`category_id` = `categories`.`id`
WHERE `categories`.`is_active` = 1
AND `products`.`is_active` = 1
GROUP BY `categories`.`id`
ORDER BY `categories`.`sort_order` ASC