app/Models/PageModel.php

SELECT *
FROM `pages`
WHERE `is_active` = 1
AND `show_in_header` = 1
ORDER BY `header_order` ASC, `title` ASC
---
    public function getHeaderPages()
    {
        return $this->where('is_active', 1)
            ->where('show_in_header', 1)
            ->orderBy('header_order', 'ASC')
            ->orderBy('title', 'ASC')
            ->findAll();

SELECT *
FROM `pages`
WHERE `is_active` = 1
AND `show_in_footer` = 1
ORDER BY `footer_order` ASC, `title` ASC
---
    public function getFooterPages()
    {
        return $this->where('is_active', 1)
            ->where('show_in_footer', 1)
            ->orderBy('footer_order', 'ASC')
            ->orderBy('title', 'ASC')
            ->findAll();

SELECT *
FROM `pages`
WHERE `slug` = 'about-us'
AND `is_active` = 1
 LIMIT 1
---
    public function getBySlug($slug)
    {
        return $this->where('slug', $slug)
            ->where('is_active', 1)
            ->first();

SELECT *
FROM `pages`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pages`
---
    public function getPagesWithPagination($perPage = 10, $search = '')
    {
        if (!empty($search)) {
            $this->groupStart()
                ->like('title', $search)
                ->orLike('slug', $search)
                ->orLike('content', $search)
                ->groupEnd();
        }

        return $this->orderBy('created_at', 'DESC')
            ->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM `pages`
---
    public function getTotalPages($search = '')
    {
        if (!empty($search)) {
            $this->groupStart()
                ->like('title', $search)
                ->orLike('slug', $search)
                ->orLike('content', $search)
                ->groupEnd();
        }

        return $this->countAllResults();