app/Models/PaymentMethodModel.php

SELECT *
FROM `payment_methods`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC, `name` ASC
---
    public function getActivePaymentMethods(): array
    {
        return $this->where('is_active', 1)
                   ->orderBy('sort_order', 'ASC')
                   ->orderBy('name', 'ASC')
                   ->findAll();