app/Models/ProductModel.php

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`is_active` = 1
AND `categories`.`is_active` = 1
ORDER BY `products`.`created_at` DESC
 LIMIT 12
---
    public function getActiveProducts($limit = null)
    {
        $builder = $this->select('products.*, categories.name as category_name')
                       ->join('categories', 'categories.id = products.category_id')
                       ->where('products.is_active', 1)
                       ->where('categories.is_active', 1)
                       ->orderBy('products.created_at', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        return $builder->findAll();

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`is_featured` = 1
AND `products`.`is_active` = 1
AND `categories`.`is_active` = 1
 LIMIT 8
---
    public function getFeaturedProducts($limit = 8)
    {
        return $this->select('products.*, categories.name as category_name')
                   ->join('categories', 'categories.id = products.category_id')
                   ->where('products.is_featured', 1)
                   ->where('products.is_active', 1)
                   ->where('categories.is_active', 1)
                   ->limit($limit)
                   ->findAll();

SELECT MIN(CASE WHEN sale_price IS NOT NULL THEN sale_price ELSE price END) as min_price,
            MAX(CASE WHEN sale_price IS NOT NULL THEN sale_price ELSE price END) as max_price
FROM `products`
WHERE `is_active` = 1
 LIMIT 1
---
    public function getPriceRange()
    {
        $result = $this->select('
            MIN(CASE WHEN sale_price IS NOT NULL THEN sale_price ELSE price END) as min_price,
            MAX(CASE WHEN sale_price IS NOT NULL THEN sale_price ELSE price END) as max_price
        ', false)
        ->where('is_active', 1)
        ->first();