app/Models/SettingModel.php

SELECT *
FROM `settings`
WHERE `setting_key` = 'currency'
 LIMIT 1
---
    public function getSetting(string $key, $default = null)
    {
        $setting = $this->where('setting_key', $key)->first();

SELECT *
FROM `settings`
---
    public function getAllSettings(): array
    {
        $settings = $this->findAll();