app/Models/ShippingMethodModel.php

    public function getActiveShippingMethods(): array
    {
        return $this->where('is_active', 1)
                   ->orderBy('sort_order', 'ASC')
                   ->findAll();
---
SELECT *
FROM `shipping_methods`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC