app/Models/TestimonialModel.php

    public function getFeaturedTestimonials($limit = 6)
    {
        return $this->where('is_active', 1)
                   ->where('is_featured', 1)
                   ->orderBy('sort_order', 'ASC')
                   ->orderBy('created_at', 'DESC')
                   ->limit($limit)
                   ->findAll();
---
SELECT *
FROM `testimonials`
WHERE `is_active` = 1
AND `is_featured` = 1
ORDER BY `sort_order` ASC, `created_at` DESC
 LIMIT 6