app/Models/UserAddressModel.php

SELECT *
FROM `user_addresses`
WHERE `user_id` = '13'
ORDER BY `is_default` DESC, `created_at` DESC
---
    public function getUserAddresses($userId)
    {
        $addresses = $this->where('user_id', $userId)->orderBy('is_default', 'DESC')->orderBy('created_at', 'DESC')->findAll();