app/Models/WishlistModel.php

SELECT *
FROM `wishlist`
WHERE `user_id` = '13'
AND `product_id` = '9'
 LIMIT 1
---
    public function isInWishlist($userId, $productId)
    {
        if (!$userId) {
            return false;
        }

        $item = $this->where(['user_id' => $userId, 'product_id' => $productId])->first();

SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `user_id` = '13'
---
    public function getWishlistCount($userId)
    {
        if (!$userId) {
            return 0;
        }

        return $this->where('user_id', $userId)->countAllResults();