app/Views/layouts/main.php

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
                                <li><a class="dropdown-item" href="<?= base_url('wishlist') ?>">My Wishlist</a></li>
                                <?php
                                $userModel = new \App\Models\UserModel();
                                $user = $userModel->find(session()->get('user_id'));